In [2]:
import pandas as pd

```- CSV - HTML - JSON  - Excel - SQL - Pickling - Flat file - Clipboard - HDFStore: PyTables (HDF5) - Feather - Parquet - ORC - SAS - SPSS - Google BigQuery - STATA
```

###  CSV (Comma Seprated Value)

**CSV Create**

In [8]:
df1=pd.DataFrame([['A',1,100],['B',2,200],['C',3,300],['D',4,400]],columns=['Name','Roll_No','Marks'])
df1.to_csv('temp/Pandas.csv',index=False)

**CSV Read**

In [5]:
df1=pd.read_csv('temp/Pandas.csv',index_col ="Roll_No",)
df1

        Name  Marks
Roll_No
1          A    100
2          B    200
3          C    300
4          D    400
5          E    500
6          F    600
7          G    100
8          H    200
9          J    900
10         J   1000
11         E   1100
12         I   1200

### XML

**XML Create**

In [6]:
#pip install lxml
df1=pd.DataFrame([['a',1,500],['b',2,600],['c',3,700]],columns=['Name','Roll No.','Marks'],index=['R1','R2','R3'])
df1.to_html('temp/Pandas.xml')

**XML Read**

In [ ]:
df1=pd.read_html('temp/Pandas.xml')
df1

### Json

**JSON Create**

In [ ]:
df1=pd.DataFrame([['a',1,500],['b',2,600],['c',3,700]],columns=['Name','Roll No.','Marks'],index=['R1','R2','R3'])
df1.to_json('temp/Pandas.json')

**JSON Read**

In [ ]:
df1=pd.read_json('temp/Pandas.json')
df1

### Excel

In [11]:
#pip install openpyxl
from pandas import ExcelWriter
from pandas import ExcelFile

**Excel Create**

In [12]:
df1=pd.DataFrame([['a',1,500],['b',2,600],['c',3,700]],columns=['Name','Roll No.','Marks'],index=['R1','R2','R3'])
df2=pd.DataFrame([['d',1,500],['e',2,600],['f',3,700]],columns=['Name','Roll No.','Marks'],index=['R4','R5','R6'])

In [13]:
writer = ExcelWriter('temp/Pandas.xlsx')
df1.to_excel(writer,'Sheet1',index=False)
df2.to_excel(writer,'Sheet2',index=False)
writer.save()

**Excel Read**

In [14]:
pd.read_excel('temp/Pandas.xlsx')

  Name  Roll No.  Marks
0    a         1    500
1    b         2    600
2    c         3    700

In [15]:
pd.read_excel(open('temp/Pandas.xlsx', 'rb'),sheet_name='Sheet1')

  Name  Roll No.  Marks
0    a         1    500
1    b         2    600
2    c         3    700

In [16]:
pd.read_excel(open('temp/Pandas.xlsx', 'rb'),sheet_name='Sheet2')

  Name  Roll No.  Marks
0    d         1    500
1    e         2    600
2    f         3    700

## DataBase

In [17]:
#pip install sqlalchemy
#pip install pymysql
from sqlalchemy import create_engine

**mysql**

In [20]:
import pymysql as sql
import getpass
password=getpass.getpass(prompt='Password: ', stream=None) 
con = sql.connect(host='localhost', user='root',  password=password, database='new_schema',port=3306)
engine = create_engine('mysql+pymysql://root:MasterAdminSql@localhost/new_schema')

Password: ········

**Sqlite3**

In [3]:
# import sqlite3
# con = sqlite3.connect('_db/example.db')
# engine = create_engine(f"sqlite:///_db/example.db")

**df to db table**

In [21]:
df=pd.read_csv('_dataset/tips.csv')
df.head()

   total_bill   tip  gender smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [22]:
df.to_sql('tips',con=engine)

**db table to df**

In [23]:
df2=pd.read_sql('select * from tips',con)
df2.head()

   index  total_bill   tip  gender smoker  day    time  size
0      0       16.99  1.01  Female     No  Sun  Dinner     2
1      1       10.34  1.66    Male     No  Sun  Dinner     3
2      2       21.01  3.50    Male     No  Sun  Dinner     3
3      3       23.68  3.31    Male     No  Sun  Dinner     2
4      4       24.59  3.61  Female     No  Sun  Dinner     4

## Pickling

In [4]:
original_df = pd.DataFrame({"foo": range(5), "bar": range(5, 10)})
original_df

   foo  bar
0    0    5
1    1    6
2    2    7
3    3    8
4    4    9

In [6]:
original_df.to_pickle("temp/dummy.pkl")

In [8]:
unpickled_df = pd.read_pickle("temp/dummy.pkl")
unpickled_df

   foo  bar
0    0    5
1    1    6
2    2    7
3    3    8
4    4    9

In [ ]:
# import os
# os.remove("temp/dummy.pkl")